using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class StaticData : MonoBehaviour {

	public static string[] FoodEasy = {"ごはん","たまご","にく","さかな","やさい","みず","りんご"};
	public static string[] FoodMedium = {"さとう","おかし","べんと","しお","みるく","みかん"};
	public static string[] FoodHard = {"さけ","すきやき","さしみ","すし","てんぷら","おちゃ"};

	public static string[] ToolEasy = {"いす","はし","かみ","くつ","ほん","はこ","えんぴつ"};
	public static string[] ToolMedium = {"とけい","つくえ","はさみ","めいし","かぎ","ざっし","じしょ"};
	public static string[] ToolHard = {"かさ","てちょう","めがね","かばん","でんち","しんぶん","ちず"};

	public static string[] PlaceEasy = {"かわ","うみ","やま","うち","えき","にわ","まち"};
	public static string[] PlaceMedium = {"ほんや","まつり","くうこう","ぎんこう","じむしょ","かいしゃ","かいだん","こうえん"};
	public static string[] PlaceHard = {"としょかん","がっこう","せかい","ゆうびんきょく","びじゅつかん","きょうしつ","びょういん","だいがく"};

	public static string[] AnimalEasy = {"くま","とり","ねこ","うし","つる","いぬ"};
	public static string[] AnimalMedium = {"さる","いるか","ぞう","さかな","きつね","かえる","きりん","やぎ","うま"};
	public static string[] AnimalHard = {"しまうま","ねずみ","たこ","ぶた","さめ","ひつじ","へび","いか","りす","とら","かめ","くじら","おおかみ"};

	public static string[] Chaos = {"ごはん","たまご","にく","さかな","やさい","みず","りんご",
		"さとう","おかし","べんと","しお","みるく","みかん",
		"さけ","すきやき","さしみ","すし","てんぷら","おちゃ",
		"いす","はし","かみ","くつ","ほん","はこ","えんぴつ",
		"とけい","つくえ","はさみ","めいし","かぎ","ざっし","じしょ",
		"かさ","てちょう","めがね","かばん","でんち","しんぶん","ちず",
		"かわ","うみ","やま","うち","えき","にわ","まち",
		"ほんや","まつり","くうこう","ぎんこう","じむしょ","かいしゃ","かいだん","こうえん",
		"としょかん","がっこう","せかい","ゆうびんきょく","びじゅつかん","きょうしつ","びょういん","だいがく",
		"くま","とり","ねこ","うし","つる","いぬ",
		"さる","いるか","ぞう","さかな","きつね","かえる","きりん","やぎ","うま",
		"しまうま","ねずみ","たこ","ぶた","さめ","ひつじ","へび","いか","りす","とら","かめ","くじら","おおかみ",
		"かんこく","き","ちゅうごく","にほん"};

	public static string[] Alphabet = {"あ","い","う","え","お","か","き","く","け","こ","さ","し","す","せ","そ",
		"た","ち","つ","て","と","な","に","ぬ","ね","の","は","ひ","ふ","へ","ほ","ま","み","む","め","も","や","ゆ","よ",
		"ら","り","る","れ","ろ","わ","を","ん","が","ぎ","ぐ","げ","ご","ざ","じ","ず","ぜ","ぞ","だ","ぢ","づ","で","ど",
		"ば","び","ぶ","べ","ぼ","ぱ","ぴ","ぷ","ぺ","ぽ"};


	public static int selectedCategory = 0;
	public static string selectedDifficulty = "";
	public static int currLvl = 1;
	public static int neededWord;
	public static string tempDetailGallery = "";
}
